SubscriberService/exampleRequests/DeliverANPRTrafficDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns2="http://www.thalesgroup.com/NTIS/Datex2Extensions/1.0Beta1"
	xmlns:ns3="http://datex2.eu/schema/2/2_0" xmlns:sub="http://www.thalesgroup.com/NTIS/SubscriberService"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header />
	<soapenv:Body>
		<sub:DeliverANPRTrafficDataRequest>
			<sub:D2LogicalModel modelBaseVersion="2">
				<ns3:exchange>
					<ns3:supplierIdentification>
						<ns3:country>gb</ns3:country>
						<ns3:nationalIdentifier>AnprTest1</ns3:nationalIdentifier>
					</ns3:supplierIdentification>
				</ns3:exchange>
				<ns3:payloadPublication lang="en" xsi:type="ns2:JourneyTimePublication">
					<ns3:feedDescription>
						<ns3:values>
							<ns3:value>1</ns3:value>
						</ns3:values>
					</ns3:feedDescription>
					<ns3:publicationTime>2012-02-08T10:54:18.378Z</ns3:publicationTime>
					<ns3:publicationCreator>
						<ns3:country>gb</ns3:country>
						<ns3:nationalIdentifier>AnprTest1</ns3:nationalIdentifier>
					</ns3:publicationCreator>
					<ns2:headerInformation>
						<ns3:confidentiality>restrictedToAuthoritiesTrafficOperatorsAndPublishers</ns3:confidentiality>
						<ns3:informationStatus>real</ns3:informationStatus>
						<ns3:urgency>normalUrgency</ns3:urgency>
					</ns2:headerInformation>
					<ns2:journeyTimes>
						<ns2:journeyTime>
							<ns2:camera1>ThisIsATestCamera1FieldThatMustBe40Chars</ns2:camera1>
							<ns2:camera2>ThisIsATestCamera2FieldThatMustBe40Chars</ns2:camera2>
							<ns2:timeStamp>2012-02-08T10:54:15.672Z</ns2:timeStamp>
							<ns2:travelTime>1000</ns2:travelTime>
							<ns2:isSuspect>true</ns2:isSuspect>
						</ns2:journeyTime>
					</ns2:journeyTimes>
				</ns3:payloadPublication>
			</sub:D2LogicalModel>
		</sub:DeliverANPRTrafficDataRequest>
	</soapenv:Body>
</soapenv:Envelope>
